tests/app/config/packages/test/models/checkout/checkout.dot
digraph workflow {
  ratio="compress" rankdir="LR" label=""
  node [fontsize="9" fontname="Arial" color="#333333" fillcolor="lightblue" fixedsize="1" width="1"];
  edge [fontsize="9" fontname="Arial" color="#333333" arrowhead="normal" arrowsize="0.5"];

  place_e83249bd3ba79932e16fb1fb5100dafade9954c2 [label="home", shape=circle, style="filled"];
  place_8df9aa6c1a8fbc2bf1fff5c5d67d147e334f94cf [label="awaitingAccount", shape=circle];
  place_be8df8efa2cb6b2300fe2f82d8d9b19d4d9f3006 [label="awaitingPersonalDetails", shape=circle];
  place_e8718de4f73418b4e1c7ad5c42bec684a4a9caa9 [label="awaitingBillingAddress", shape=circle];
  place_636a9cc7645cbe8e1dacce71000bb0db745a39e1 [label="awaitingPassword", shape=circle];
  place_847054e1b2a00d322a1b38073e56ce2b2e2c1faa [label="awaitingPolicyAgreement", shape=circle];
  place_8848eae5cdc91580e8ebbe8e75739f7cecf6037f [label="awaitingDeliveryAndBillingAddressesSameOrDifferentConfirmation", shape=circle];
  place_b5da8f0027407937d7b9d6199a5d40d174c2661a [label="personalDetailsFilled", shape=circle];
  place_bbcddce3edfbf6793be4e1761595ad9dd36cf0fb [label="billingAddressFilled", shape=circle];
  place_133afdf482fd18037e3a0e10ed8a6ab4f9161d40 [label="passwordFilled", shape=circle];
  place_5a2a60713a05ee7b81892122d7786206b062ce64 [label="policyAgreed", shape=circle];
  place_d5a0ac90533bdd6a26ff0c0c1f1de607163fffbc [label="deliveryAndBillingAddressesSameOrDifferentConfirmed", shape=circle];
  place_95c4228878ef8ed807e02b7e17abad8cfa27a63b [label="awaitingDeliveryAddress", shape=circle];
  place_db2a0e8a240c19feca6bf300b83c712f43d74c07 [label="awaitingDeliveryMethod", shape=circle];
  place_866591cec37483a4a6ab3489cb867167720a8a29 [label="awaitingPaymentMethod", shape=circle];
  place_9eb14a96cbd881f3941bab3ed0a93b731399be5e [label="awaitingTermsAndConditionsAgreement", shape=circle];
  place_62f8f8cbcff902a31870b7f393bded072b620a2f [label="paymentMethodSelected", shape=circle];
  place_b6bf01197de322ba3d7fd694c4ab1e26acc89569 [label="termsAndConditionsAgreed", shape=circle];
  place_3fbdba9ac98acf5009dd6cd28932c97b69e6f632 [label="awaitingOrderConfirmation", shape=circle];
  place_cbeec9c5b8f73f7335a9b9606865084b73d6db44 [label="orderPlaced", shape=circle];
  transition_5cd53fca43ba3196006fa94f9d42cec71cb25c44 [label="addProductAndCheckout", shape=box, shape="box", regular="1"];
  transition_2736fab291f04e69b62d490c3c09361f5b82461a [label="login", shape=box, shape="box", regular="1"];
  transition_1b8a31d24f7e7b4bb00f985657ef664c0fd484f7 [label="guestCheckout", shape=box, shape="box", regular="1"];
  transition_4a67e46d8a1b96a2f1ebfa90009ae18258516248 [label="registerAccount", shape=box, shape="box", regular="1"];
  transition_6ca7bb9639941de4f3d43da60a79d965e688398c [label="fillPersonalDetails", shape=box, shape="box", regular="1"];
  transition_88846e7311af81ea2b6eb30ced42e8e9a035674e [label="fillBillingAddress", shape=box, shape="box", regular="1"];
  transition_3564e2bbe48b061a3985d46ebf9bb36a0c94de0e [label="fillPassword", shape=box, shape="box", regular="1"];
  transition_1c63ec2170d8f8ac4dc36183b13dc6d099ee57f8 [label="agreePolicy", shape=box, shape="box", regular="1"];
  transition_2b3ac151b68ed4613463c233ef9bb71eee9a41ca [label="confirmDeliveryAndBillingAddressesSameOrDifferent", shape=box, shape="box", regular="1"];
  transition_901c5f630db8b0e18779359c8d949e4395268689 [label="useExistingBillingAddress", shape=box, shape="box", regular="1"];
  transition_fe12c392e32e62dd39eccef4248a39e19252acdf [label="useNewBillingAddress", shape=box, shape="box", regular="1"];
  transition_f657ce882497b9a9077da3718565de3bad23c63d [label="continueRegisterAccountWithDifferentAddresses", shape=box, shape="box", regular="1"];
  transition_a61bc306e3f2f04e552d26d524be63c8705f123d [label="continueGuestCheckoutDifferentAddresses", shape=box, shape="box", regular="1"];
  transition_85cb56b3c57574697992910e08dcf3510fdb5dbf [label="continueRegisterAccountWithSameAddresses", shape=box, shape="box", regular="1"];
  transition_cbd13101ca8b9f00b84a872cdbcc9cec19007ded [label="continueGuestCheckoutSameAddresses", shape=box, shape="box", regular="1"];
  transition_40f7b37f0743d75d1323955148aa023e7533d8af [label="useExistingDeliveryAddress", shape=box, shape="box", regular="1"];
  transition_40d8c3069664fee3e86bfcb2c57fcf2ef837a066 [label="useNewDeliveryAddress", shape=box, shape="box", regular="1"];
  transition_d0456ba3eec7c63caee5da332a123d063ab793f0 [label="addDeliveryAddress", shape=box, shape="box", regular="1"];
  transition_b5875e454b984dd6f6eb7bf822dffab05390bf4a [label="selectDeliveryMethodAndContinue", shape=box, shape="box", regular="1"];
  transition_7d47591653d2aeaac4a5e8444bbb3f592b2876b6 [label="selectPaymentMethod", shape=box, shape="box", regular="1"];
  transition_ba818b1269b003f72555d75390e2751ffcde31a5 [label="agreeTermsAndConditions", shape=box, shape="box", regular="1"];
  transition_06988b6c6c7ca648edbd10764e1b26c98f121182 [label="continueWithPaymentMethod", shape=box, shape="box", regular="1"];
  transition_f158550b6472279811abb832e1fa84c33a264bd1 [label="confirmOrder", shape=box, shape="box", regular="1"];
  transition_f5f67f37bdb26da1aa426f3f570c10051eb8a1f6 [label="continueShopping", shape=box, shape="box", regular="1"];
  place_e83249bd3ba79932e16fb1fb5100dafade9954c2 -> transition_5cd53fca43ba3196006fa94f9d42cec71cb25c44 [style="solid"];
  transition_5cd53fca43ba3196006fa94f9d42cec71cb25c44 -> place_8df9aa6c1a8fbc2bf1fff5c5d67d147e334f94cf [style="solid"];
  place_8df9aa6c1a8fbc2bf1fff5c5d67d147e334f94cf -> transition_2736fab291f04e69b62d490c3c09361f5b82461a [style="solid"];
  transition_2736fab291f04e69b62d490c3c09361f5b82461a -> place_e8718de4f73418b4e1c7ad5c42bec684a4a9caa9 [style="solid"];
  place_8df9aa6c1a8fbc2bf1fff5c5d67d147e334f94cf -> transition_1b8a31d24f7e7b4bb00f985657ef664c0fd484f7 [style="solid"];
  transition_1b8a31d24f7e7b4bb00f985657ef664c0fd484f7 -> place_be8df8efa2cb6b2300fe2f82d8d9b19d4d9f3006 [style="solid"];
  transition_1b8a31d24f7e7b4bb00f985657ef664c0fd484f7 -> place_e8718de4f73418b4e1c7ad5c42bec684a4a9caa9 [style="solid"];
  transition_1b8a31d24f7e7b4bb00f985657ef664c0fd484f7 -> place_8848eae5cdc91580e8ebbe8e75739f7cecf6037f [style="solid"];
  place_8df9aa6c1a8fbc2bf1fff5c5d67d147e334f94cf -> transition_4a67e46d8a1b96a2f1ebfa90009ae18258516248 [style="solid"];
  transition_4a67e46d8a1b96a2f1ebfa90009ae18258516248 -> place_be8df8efa2cb6b2300fe2f82d8d9b19d4d9f3006 [style="solid"];
  transition_4a67e46d8a1b96a2f1ebfa90009ae18258516248 -> place_e8718de4f73418b4e1c7ad5c42bec684a4a9caa9 [style="solid"];
  transition_4a67e46d8a1b96a2f1ebfa90009ae18258516248 -> place_636a9cc7645cbe8e1dacce71000bb0db745a39e1 [style="solid"];
  transition_4a67e46d8a1b96a2f1ebfa90009ae18258516248 -> place_847054e1b2a00d322a1b38073e56ce2b2e2c1faa [style="solid"];
  transition_4a67e46d8a1b96a2f1ebfa90009ae18258516248 -> place_8848eae5cdc91580e8ebbe8e75739f7cecf6037f [style="solid"];
  place_be8df8efa2cb6b2300fe2f82d8d9b19d4d9f3006 -> transition_6ca7bb9639941de4f3d43da60a79d965e688398c [style="solid"];
  transition_6ca7bb9639941de4f3d43da60a79d965e688398c -> place_b5da8f0027407937d7b9d6199a5d40d174c2661a [style="solid"];
  place_e8718de4f73418b4e1c7ad5c42bec684a4a9caa9 -> transition_88846e7311af81ea2b6eb30ced42e8e9a035674e [style="solid"];
  transition_88846e7311af81ea2b6eb30ced42e8e9a035674e -> place_bbcddce3edfbf6793be4e1761595ad9dd36cf0fb [style="solid"];
  place_636a9cc7645cbe8e1dacce71000bb0db745a39e1 -> transition_3564e2bbe48b061a3985d46ebf9bb36a0c94de0e [style="solid"];
  transition_3564e2bbe48b061a3985d46ebf9bb36a0c94de0e -> place_133afdf482fd18037e3a0e10ed8a6ab4f9161d40 [style="solid"];
  place_847054e1b2a00d322a1b38073e56ce2b2e2c1faa -> transition_1c63ec2170d8f8ac4dc36183b13dc6d099ee57f8 [style="solid"];
  transition_1c63ec2170d8f8ac4dc36183b13dc6d099ee57f8 -> place_5a2a60713a05ee7b81892122d7786206b062ce64 [style="solid"];
  place_8848eae5cdc91580e8ebbe8e75739f7cecf6037f -> transition_2b3ac151b68ed4613463c233ef9bb71eee9a41ca [style="solid"];
  transition_2b3ac151b68ed4613463c233ef9bb71eee9a41ca -> place_d5a0ac90533bdd6a26ff0c0c1f1de607163fffbc [style="solid"];
  place_e8718de4f73418b4e1c7ad5c42bec684a4a9caa9 -> transition_901c5f630db8b0e18779359c8d949e4395268689 [style="solid"];
  transition_901c5f630db8b0e18779359c8d949e4395268689 -> place_95c4228878ef8ed807e02b7e17abad8cfa27a63b [style="solid"];
  place_e8718de4f73418b4e1c7ad5c42bec684a4a9caa9 -> transition_fe12c392e32e62dd39eccef4248a39e19252acdf [style="solid"];
  transition_fe12c392e32e62dd39eccef4248a39e19252acdf -> place_95c4228878ef8ed807e02b7e17abad8cfa27a63b [style="solid"];
  place_b5da8f0027407937d7b9d6199a5d40d174c2661a -> transition_f657ce882497b9a9077da3718565de3bad23c63d [style="solid"];
  place_bbcddce3edfbf6793be4e1761595ad9dd36cf0fb -> transition_f657ce882497b9a9077da3718565de3bad23c63d [style="solid"];
  place_133afdf482fd18037e3a0e10ed8a6ab4f9161d40 -> transition_f657ce882497b9a9077da3718565de3bad23c63d [style="solid"];
  place_5a2a60713a05ee7b81892122d7786206b062ce64 -> transition_f657ce882497b9a9077da3718565de3bad23c63d [style="solid"];
  place_d5a0ac90533bdd6a26ff0c0c1f1de607163fffbc -> transition_f657ce882497b9a9077da3718565de3bad23c63d [style="solid"];
  transition_f657ce882497b9a9077da3718565de3bad23c63d -> place_95c4228878ef8ed807e02b7e17abad8cfa27a63b [style="solid"];
  place_b5da8f0027407937d7b9d6199a5d40d174c2661a -> transition_a61bc306e3f2f04e552d26d524be63c8705f123d [style="solid"];
  place_bbcddce3edfbf6793be4e1761595ad9dd36cf0fb -> transition_a61bc306e3f2f04e552d26d524be63c8705f123d [style="solid"];
  place_d5a0ac90533bdd6a26ff0c0c1f1de607163fffbc -> transition_a61bc306e3f2f04e552d26d524be63c8705f123d [style="solid"];
  transition_a61bc306e3f2f04e552d26d524be63c8705f123d -> place_95c4228878ef8ed807e02b7e17abad8cfa27a63b [style="solid"];
  place_b5da8f0027407937d7b9d6199a5d40d174c2661a -> transition_85cb56b3c57574697992910e08dcf3510fdb5dbf [style="solid"];
  place_bbcddce3edfbf6793be4e1761595ad9dd36cf0fb -> transition_85cb56b3c57574697992910e08dcf3510fdb5dbf [style="solid"];
  place_133afdf482fd18037e3a0e10ed8a6ab4f9161d40 -> transition_85cb56b3c57574697992910e08dcf3510fdb5dbf [style="solid"];
  place_5a2a60713a05ee7b81892122d7786206b062ce64 -> transition_85cb56b3c57574697992910e08dcf3510fdb5dbf [style="solid"];
  place_d5a0ac90533bdd6a26ff0c0c1f1de607163fffbc -> transition_85cb56b3c57574697992910e08dcf3510fdb5dbf [style="solid"];
  transition_85cb56b3c57574697992910e08dcf3510fdb5dbf -> place_db2a0e8a240c19feca6bf300b83c712f43d74c07 [style="solid"];
  place_b5da8f0027407937d7b9d6199a5d40d174c2661a -> transition_cbd13101ca8b9f00b84a872cdbcc9cec19007ded [style="solid"];
  place_bbcddce3edfbf6793be4e1761595ad9dd36cf0fb -> transition_cbd13101ca8b9f00b84a872cdbcc9cec19007ded [style="solid"];
  place_d5a0ac90533bdd6a26ff0c0c1f1de607163fffbc -> transition_cbd13101ca8b9f00b84a872cdbcc9cec19007ded [style="solid"];
  transition_cbd13101ca8b9f00b84a872cdbcc9cec19007ded -> place_db2a0e8a240c19feca6bf300b83c712f43d74c07 [style="solid"];
  place_95c4228878ef8ed807e02b7e17abad8cfa27a63b -> transition_40f7b37f0743d75d1323955148aa023e7533d8af [style="solid"];
  transition_40f7b37f0743d75d1323955148aa023e7533d8af -> place_db2a0e8a240c19feca6bf300b83c712f43d74c07 [style="solid"];
  place_95c4228878ef8ed807e02b7e17abad8cfa27a63b -> transition_40d8c3069664fee3e86bfcb2c57fcf2ef837a066 [style="solid"];
  transition_40d8c3069664fee3e86bfcb2c57fcf2ef837a066 -> place_db2a0e8a240c19feca6bf300b83c712f43d74c07 [style="solid"];
  place_95c4228878ef8ed807e02b7e17abad8cfa27a63b -> transition_d0456ba3eec7c63caee5da332a123d063ab793f0 [style="solid"];
  transition_d0456ba3eec7c63caee5da332a123d063ab793f0 -> place_db2a0e8a240c19feca6bf300b83c712f43d74c07 [style="solid"];
  place_db2a0e8a240c19feca6bf300b83c712f43d74c07 -> transition_b5875e454b984dd6f6eb7bf822dffab05390bf4a [style="solid"];
  transition_b5875e454b984dd6f6eb7bf822dffab05390bf4a -> place_866591cec37483a4a6ab3489cb867167720a8a29 [style="solid"];
  transition_b5875e454b984dd6f6eb7bf822dffab05390bf4a -> place_9eb14a96cbd881f3941bab3ed0a93b731399be5e [style="solid"];
  place_866591cec37483a4a6ab3489cb867167720a8a29 -> transition_7d47591653d2aeaac4a5e8444bbb3f592b2876b6 [style="solid"];
  transition_7d47591653d2aeaac4a5e8444bbb3f592b2876b6 -> place_62f8f8cbcff902a31870b7f393bded072b620a2f [style="solid"];
  place_9eb14a96cbd881f3941bab3ed0a93b731399be5e -> transition_ba818b1269b003f72555d75390e2751ffcde31a5 [style="solid"];
  transition_ba818b1269b003f72555d75390e2751ffcde31a5 -> place_b6bf01197de322ba3d7fd694c4ab1e26acc89569 [style="solid"];
  place_62f8f8cbcff902a31870b7f393bded072b620a2f -> transition_06988b6c6c7ca648edbd10764e1b26c98f121182 [style="solid"];
  place_b6bf01197de322ba3d7fd694c4ab1e26acc89569 -> transition_06988b6c6c7ca648edbd10764e1b26c98f121182 [style="solid"];
  transition_06988b6c6c7ca648edbd10764e1b26c98f121182 -> place_3fbdba9ac98acf5009dd6cd28932c97b69e6f632 [style="solid"];
  place_3fbdba9ac98acf5009dd6cd28932c97b69e6f632 -> transition_f158550b6472279811abb832e1fa84c33a264bd1 [style="solid"];
  transition_f158550b6472279811abb832e1fa84c33a264bd1 -> place_cbeec9c5b8f73f7335a9b9606865084b73d6db44 [style="solid"];
  place_cbeec9c5b8f73f7335a9b9606865084b73d6db44 -> transition_f5f67f37bdb26da1aa426f3f570c10051eb8a1f6 [style="solid"];
  transition_f5f67f37bdb26da1aa426f3f570c10051eb8a1f6 -> place_e83249bd3ba79932e16fb1fb5100dafade9954c2 [style="solid"];
}
