tests/app/config/packages/test/models/checkout/checkout.plantuml
@startuml
allow_mixing
title checkout
skinparam titleBorderRoundCorner 15
skinparam titleBorderThickness 2
skinparam state {
    BackgroundColor<<initial>> #87b741
    BackgroundColor<<marked>> #3887C6
    BorderColor #3887C6
    BorderColor<<marked>> Black
    FontColor<<marked>> White
}
skinparam agent {
    BackgroundColor #ffffff
    BorderColor #3887C6
}
state "home" <<initial>>
state "awaitingAccount"
state "awaitingPersonalDetails"
state "awaitingBillingAddress"
state "awaitingPassword"
state "awaitingPolicyAgreement"
state "awaitingDeliveryAndBillingAddressesSameOrDifferentConfirmation"
state "personalDetailsFilled"
state "billingAddressFilled"
state "passwordFilled"
state "policyAgreed"
state "deliveryAndBillingAddressesSameOrDifferentConfirmed"
state "awaitingDeliveryAddress"
state "awaitingDeliveryMethod"
state "awaitingPaymentMethod"
state "awaitingTermsAndConditionsAgreement"
state "paymentMethodSelected"
state "termsAndConditionsAgreed"
state "awaitingOrderConfirmation"
state "orderPlaced"
agent "addProductAndCheckout"
agent "login"
agent "guestCheckout"
agent "registerAccount"
agent "fillPersonalDetails"
agent "fillBillingAddress"
agent "fillPassword"
agent "agreePolicy"
agent "confirmDeliveryAndBillingAddressesSameOrDifferent"
agent "useExistingBillingAddress"
agent "useNewBillingAddress"
agent "continueRegisterAccountWithDifferentAddresses"
agent "continueGuestCheckoutDifferentAddresses"
agent "continueRegisterAccountWithSameAddresses"
agent "continueGuestCheckoutSameAddresses"
agent "useExistingDeliveryAddress"
agent "useNewDeliveryAddress"
agent "addDeliveryAddress"
agent "selectDeliveryMethodAndContinue"
agent "selectPaymentMethod"
agent "agreeTermsAndConditions"
agent "continueWithPaymentMethod"
agent "confirmOrder"
agent "continueShopping"
"home" --> "addProductAndCheckout"
"addProductAndCheckout" --> "awaitingAccount"
"awaitingAccount" --> "login"
"login" --> "awaitingBillingAddress"
"awaitingAccount" --> "guestCheckout"
"guestCheckout" --> "awaitingPersonalDetails"
"guestCheckout" --> "awaitingBillingAddress"
"guestCheckout" --> "awaitingDeliveryAndBillingAddressesSameOrDifferentConfirmation"
"awaitingAccount" --> "registerAccount"
"registerAccount" --> "awaitingPersonalDetails"
"registerAccount" --> "awaitingBillingAddress"
"registerAccount" --> "awaitingPassword"
"registerAccount" --> "awaitingPolicyAgreement"
"registerAccount" --> "awaitingDeliveryAndBillingAddressesSameOrDifferentConfirmation"
"awaitingPersonalDetails" --> "fillPersonalDetails"
"fillPersonalDetails" --> "personalDetailsFilled"
"awaitingBillingAddress" --> "fillBillingAddress"
"fillBillingAddress" --> "billingAddressFilled"
"awaitingPassword" --> "fillPassword"
"fillPassword" --> "passwordFilled"
"awaitingPolicyAgreement" --> "agreePolicy"
"agreePolicy" --> "policyAgreed"
"awaitingDeliveryAndBillingAddressesSameOrDifferentConfirmation" --> "confirmDeliveryAndBillingAddressesSameOrDifferent"
"confirmDeliveryAndBillingAddressesSameOrDifferent" --> "deliveryAndBillingAddressesSameOrDifferentConfirmed"
"awaitingBillingAddress" --> "useExistingBillingAddress"
"useExistingBillingAddress" --> "awaitingDeliveryAddress"
"awaitingBillingAddress" --> "useNewBillingAddress"
"useNewBillingAddress" --> "awaitingDeliveryAddress"
"personalDetailsFilled" --> "continueRegisterAccountWithDifferentAddresses"
"continueRegisterAccountWithDifferentAddresses" --> "awaitingDeliveryAddress"
"billingAddressFilled" --> "continueRegisterAccountWithDifferentAddresses"
"passwordFilled" --> "continueRegisterAccountWithDifferentAddresses"
"policyAgreed" --> "continueRegisterAccountWithDifferentAddresses"
"deliveryAndBillingAddressesSameOrDifferentConfirmed" --> "continueRegisterAccountWithDifferentAddresses"
"personalDetailsFilled" --> "continueGuestCheckoutDifferentAddresses"
"continueGuestCheckoutDifferentAddresses" --> "awaitingDeliveryAddress"
"billingAddressFilled" --> "continueGuestCheckoutDifferentAddresses"
"deliveryAndBillingAddressesSameOrDifferentConfirmed" --> "continueGuestCheckoutDifferentAddresses"
"personalDetailsFilled" --> "continueRegisterAccountWithSameAddresses"
"continueRegisterAccountWithSameAddresses" --> "awaitingDeliveryMethod"
"billingAddressFilled" --> "continueRegisterAccountWithSameAddresses"
"passwordFilled" --> "continueRegisterAccountWithSameAddresses"
"policyAgreed" --> "continueRegisterAccountWithSameAddresses"
"deliveryAndBillingAddressesSameOrDifferentConfirmed" --> "continueRegisterAccountWithSameAddresses"
"personalDetailsFilled" --> "continueGuestCheckoutSameAddresses"
"continueGuestCheckoutSameAddresses" --> "awaitingDeliveryMethod"
"billingAddressFilled" --> "continueGuestCheckoutSameAddresses"
"deliveryAndBillingAddressesSameOrDifferentConfirmed" --> "continueGuestCheckoutSameAddresses"
"awaitingDeliveryAddress" --> "useExistingDeliveryAddress"
"useExistingDeliveryAddress" --> "awaitingDeliveryMethod"
"awaitingDeliveryAddress" --> "useNewDeliveryAddress"
"useNewDeliveryAddress" --> "awaitingDeliveryMethod"
"awaitingDeliveryAddress" --> "addDeliveryAddress"
"addDeliveryAddress" --> "awaitingDeliveryMethod"
"awaitingDeliveryMethod" --> "selectDeliveryMethodAndContinue"
"selectDeliveryMethodAndContinue" --> "awaitingPaymentMethod"
"selectDeliveryMethodAndContinue" --> "awaitingTermsAndConditionsAgreement"
"awaitingPaymentMethod" --> "selectPaymentMethod"
"selectPaymentMethod" --> "paymentMethodSelected"
"awaitingTermsAndConditionsAgreement" --> "agreeTermsAndConditions"
"agreeTermsAndConditions" --> "termsAndConditionsAgreed"
"paymentMethodSelected" --> "continueWithPaymentMethod"
"continueWithPaymentMethod" --> "awaitingOrderConfirmation"
"termsAndConditionsAgreed" --> "continueWithPaymentMethod"
"awaitingOrderConfirmation" --> "confirmOrder"
"confirmOrder" --> "orderPlaced"
"orderPlaced" --> "continueShopping"
"continueShopping" --> "home"
@enduml
